# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# # - A (7,-5); B (1,-1) -> 7,21

pointA = [float(input('Введите координаты точки 1 (сначала x, затем y): '))
          for i in range(2)]
pointB = [float(input('Введите координаты точки 2 (сначала x, затем y): '))
          for i in range(2)]
print('Координаты точки 1: ', pointA)
print('Координаты точки 2: ', pointB)

d = ((pointB[0]-pointA[0])**2+(pointB[1]-pointA[1])**2)
dist = float(pow(d,0.5))
print(f'Расстояние между точками: {dist:.3f}')

