# Вычислить число c заданной точностью d
num = float(input('Введите дробное число: '))
format = int(input('С какой точностью вывести чисо? '))
print(round(num, format))

